Autodesk.Revit.UI.PreviewControl.viewControl_UnLoaded(System.Object,System.Windows.RoutedEventArgs)
This is the unloaded event handler and raised when the control is removed from within
an element tree of loaded elements (dispose the control explicitly by users).

Autodesk.Revit.UI.PreviewControl.Dispose
This method is called if the user explicitly disposes of the
object (by calling the Dispose method in other managed languages,
or the destructor in C++).

Autodesk.Revit.UI.PreviewControl.ScrollbarVisibility
The visibility of the preview view scrollbars.
Since: 2014

Autodesk.Revit.UI.PreviewControl.UIView
The UI view representing the preview view.
Remarks: Use this handle to manipulate the zoom and pan of the view.
Since: 2014

Autodesk.Revit.UI.PreviewControl.ViewId
The view Id.
Since: 2013

Autodesk.Revit.UI.PreviewControl.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a preview control.
document: The document.
viewId: The view id want to browse in this control.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when dbDocument or viewId is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the given document is a linked document or the given viewId is invalid or the view is a schedule
or other non-graphical view such as schedule views or the project browser view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when there is an active preview control already.
Since: 2013

Autodesk.Revit.UI.PreviewControl
Presents a preview control to browse the Revit model.
Remarks:  The dialog or form or window host this preview control must be modal.
The view can be any graphical view but not a non-graphical view. And only one can be active.
The view can be manipulated by embedded view cube and the visibility and graphical settings
set on the view will be evident in the preview control.
Since: 2013